### PANDAS

major tool used for wrangling data in data science and analytics -it is very important. Knowledge of pandas deeply influences how well one can wrangle data. It is built off Numpy

it helps you handle data in tabular format

employers look out a lot for you knowledge of pandas

In [87]:
# load libraries
import pandas as pd
import numpy as np

A series is the functional unit of pandas

In [88]:
#numpy array

In [89]:
a = [1,2,3,4,5]

In [90]:
arr = np.array([1, 2, 3, 4, 5])
arr

array([1, 2, 3, 4, 5])

recall that a numpy array is created from a list and ...

A pandas series can be created from a list, numpy array and a dictionary

difference between a numpy array and a pandas series: the index of a numpy array is fixed while the indez of a pandas series can be customized

How to creat a pandas series from a list:

In [91]:
# consider the list a
a

[1, 2, 3, 4, 5]

In [92]:
# note that the S inSeries is capitalized
ser = pd.Series(a)
ser

0    1
1    2
2    3
3    4
4    5
dtype: int64

note that in ser above, the first column represents the index positions of the values on the second column

How to create series from an array

In [93]:
arr

array([1, 2, 3, 4, 5])

In [94]:
ser_1 = pd.Series(arr) #create a series from a one dimensional array (vector. not a matrix)
ser_1

0    1
1    2
2    3
3    4
4    5
dtype: int64

how to create a series from a dictionary

In [95]:
d = {0:1, 1:2, 2:3, 3:4, 4:5}

In [96]:
ser_2 = pd.Series(d) #create a series from a dictionary
ser_2

0    1
1    2
2    3
3    4
4    5
dtype: int64

Let us try creating a custom index for a series

In [97]:
a

[1, 2, 3, 4, 5]

In [98]:
ser = pd.Series(a, index=['a', 'b', 'c', 'd', 'e']) #array
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [99]:
d = {'a':1, 'b':2, 'c':3, 'd':4, 'e':5}
# recall that the key of a dictionary represents the index
# note that you can not pass in the "index" argument as with the array above

In [100]:
ser_2 = pd.Series(d)

In [101]:
ser_2

a    1
b    2
c    3
d    4
e    5
dtype: int64

pandas calculations are similar to numpy, however, the indices must be same. I.e 0 == 0, 1 == 1, etc

In [102]:
ser_1 * ser_2
#this does not work because ser_1 (0, 1, 2...) does not have the same indices with ser_2 (a, b, c...)

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
dtype: float64

In [103]:
ser_1 * ser_1 #this works; similar indices

0     1
1     4
2     9
3    16
4    25
dtype: int64

a series is one dimensional, once it has two columns it is a dataframe

### a combination of Pandas series that have a uniform indices gives a pandas dataframe(aka spreadsheet)

In [104]:
#create a dataframe from this fabricated nested list
nst_lst = [[1,2,3,5], [4,5,6,1], [7,8,9,3], [2,5,7,4]]

In [105]:
pd.DataFrame(nst_lst, columns=['A', 'B', 'C', 'D'])

   A  B  C  D
0  1  2  3  5
1  4  5  6  1
2  7  8  9  3
3  2  5  7  4

In [106]:
nst_arr = np.array(nst_lst)

In [107]:
#array
pd.DataFrame(nst_arr, columns=['A', 'B', 'C', 'D'])
# Here, the key becomes the column name

   A  B  C  D
0  1  2  3  5
1  4  5  6  1
2  7  8  9  3
3  2  5  7  4

In [108]:
# forming a dataframe from a dictionary
nst_dict = {'A':[1,2,3,5], 'B':[4,5,6,1], 'C':[7,8,9,3], 'D':[2,5,7,4]}
pd.DataFrame(nst_dict, index = ['w','x','y','z'])

   A  B  C  D
w  1  4  7  2
x  2  5  8  5
y  3  6  9  7
z  5  1  3  4

In [109]:
df = pd.DataFrame(np.random.rand(6,6), columns=['u','v','w','x','y','z'])
df

          u         v         w         x         y         z
0  0.091408  0.956450  0.789952  0.699326  0.562525  0.211728
1  0.756130  0.278117  0.336533  0.998538  0.643443  0.654822
2  0.724500  0.366759  0.064351  0.556160  0.608005  0.467680
3  0.418658  0.806325  0.743815  0.446068  0.982367  0.376111
4  0.357223  0.211679  0.311172  0.083150  0.344027  0.074372
5  0.601777  0.610877  0.627623  0.972048  0.019379  0.417049

##### dataframe manipulations

In [110]:
# how to call a columns from df dataframe
df['v']

0    0.956450
1    0.278117
2    0.366759
3    0.806325
4    0.211679
5    0.610877
Name: v, dtype: float64

In [111]:
type(df['v']) #a single column is one dimentional

pandas.core.series.Series

In [112]:
df.iloc[:,:2] #df.iloc takes the index location of value to be called out

          u         v
0  0.091408  0.956450
1  0.756130  0.278117
2  0.724500  0.366759
3  0.418658  0.806325
4  0.357223  0.211679
5  0.601777  0.610877

In [113]:
df.loc[5] # returns row  value of all the columns. takes in one arguement df.loc[[5,6]]

u    0.601777
v    0.610877
w    0.627623
x    0.972048
y    0.019379
z    0.417049
Name: 5, dtype: float64

In [114]:
df[['u', 'v']]

          u         v
0  0.091408  0.956450
1  0.756130  0.278117
2  0.724500  0.366759
3  0.418658  0.806325
4  0.357223  0.211679
5  0.601777  0.610877

In [115]:
type(df[['u', 'v']])

pandas.core.frame.DataFrame

In [116]:
df[['u', 'v', 'w']]

          u         v         w
0  0.091408  0.956450  0.789952
1  0.756130  0.278117  0.336533
2  0.724500  0.366759  0.064351
3  0.418658  0.806325  0.743815
4  0.357223  0.211679  0.311172
5  0.601777  0.610877  0.627623

In [117]:
type(df[['u', 'v', 'w']])

pandas.core.frame.DataFrame

In [118]:
df

          u         v         w         x         y         z
0  0.091408  0.956450  0.789952  0.699326  0.562525  0.211728
1  0.756130  0.278117  0.336533  0.998538  0.643443  0.654822
2  0.724500  0.366759  0.064351  0.556160  0.608005  0.467680
3  0.418658  0.806325  0.743815  0.446068  0.982367  0.376111
4  0.357223  0.211679  0.311172  0.083150  0.344027  0.074372
5  0.601777  0.610877  0.627623  0.972048  0.019379  0.417049

how to create a new column

In [119]:
df['a'] = df['u'] + df['v'] #creating a new column

In [120]:
df

          u         v         w         x         y         z         a
0  0.091408  0.956450  0.789952  0.699326  0.562525  0.211728  1.047858
1  0.756130  0.278117  0.336533  0.998538  0.643443  0.654822  1.034248
2  0.724500  0.366759  0.064351  0.556160  0.608005  0.467680  1.091259
3  0.418658  0.806325  0.743815  0.446068  0.982367  0.376111  1.224983
4  0.357223  0.211679  0.311172  0.083150  0.344027  0.074372  0.568902
5  0.601777  0.610877  0.627623  0.972048  0.019379  0.417049  1.212654

In [121]:
b = [4,5,6,7,8,9]

In [122]:
df['b'] = pd.Series(b, index=[0,1,2,3,4,5])
df

          u         v         w         x         y         z         a  b
0  0.091408  0.956450  0.789952  0.699326  0.562525  0.211728  1.047858  4
1  0.756130  0.278117  0.336533  0.998538  0.643443  0.654822  1.034248  5
2  0.724500  0.366759  0.064351  0.556160  0.608005  0.467680  1.091259  6
3  0.418658  0.806325  0.743815  0.446068  0.982367  0.376111  1.224983  7
4  0.357223  0.211679  0.311172  0.083150  0.344027  0.074372  0.568902  8
5  0.601777  0.610877  0.627623  0.972048  0.019379  0.417049  1.212654  9

In [123]:
df['c'] = pd.Series(np.random.rand(6), index = [0,1,2,3,4,5])
df

,u,v,w,x,y,z,a,b,c
0,0.091408,0.956450,0.789952,0.699326,0.562525,0.211728,1.047858,4,0.791121
1,0.756130,0.278117,0.336533,0.998538,0.643443,0.654822,1.034248,5,0.978904
2,0.724500,0.366759,0.064351,0.556160,0.608005,0.467680,1.091259,6,0.054112
3,0.418658,0.806325,0.743815,0.446068,0.982367,0.376111,1.224983,7,0.579359
4,0.357223,0.211679,0.311172,0.083150,0.344027,0.074372,0.568902,8,0.828577
5,0.601777,0.610877,0.627623,0.972048,0.019379,0.417049,1.212654,9,0.964517

In [124]:
#how to drop a column
df.drop('b', axis=1, inplace = True)

In [125]:
columns = ['k', 'x', 't']

In [126]:
df_1 = pd.DataFframe(np.random.rand(6,3), index=[5,6,7,8,9,10], columns=columns)

AttributeError: module 'pandas' has no attribute 'DataFframe'

In [ ]:
dff = pd.concat([df, df_1], axis=1)
dff

### Useful Methods in Pandas

In [ ]:
df = pd.read_csv(r"/Users/joanneosuchukwu/Downloads/USA_Housing.csv", nrows=500)

In [ ]:
df

In [ ]:
df.info() #check data info

In [ ]:
# quick descriptive summary of the data
df.describe()

In [ ]:
df.describe().T

In [ ]:
df.head() # gives us the first five rows of the data unless we specify how many first rows we want to see in the argument

In [ ]:
pi = pd.DataFrame([[1,2,3,4,5,6,7,8], [4,5,6,2,3,4,5,6], [7,8,9,5,6,4,3,3], [0,4,5,4,5,3,5,6]], columns = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'])

In [ ]:
pi

In [ ]:
type(pi)

In [ ]:
pi.drop('G', axis = 1)

In [ ]:
pi

In [ ]:
pi.drop('G', axis = 1, inplace = False)

In [ ]:
pi.drop('G', axis = 1)

In [ ]:
pi.drop('D', axis = 1, inplace = True)

In [ ]:
pi.drop('G', axis = 1)

In [ ]:
pi

# How to deal with missing data in a table

In [188]:
new_lst = [[1,2,3,4], [np.nan, 4,5,6], [7,8,np.nan,9]]

In [189]:
mis = pd.DataFrame(new_lst)

In [190]:
mis

     0  1    2  3
0  1.0  2  3.0  4
1  NaN  4  5.0  6
2  7.0  8  NaN  9

In [191]:
mis.fillna(method='ffill') #fills with value above missing value

     0  1    2  3
0  1.0  2  3.0  4
1  1.0  4  5.0  6
2  7.0  8  5.0  9

In [192]:
mis.fillna(method='bfill') #feels with vallue below missing value

     0  1    2  3
0  1.0  2  3.0  4
1  7.0  4  5.0  6
2  7.0  8  NaN  9

In [193]:
mis.interpolate() # involves some mathematical computations

     0  1    2  3
0  1.0  2  3.0  4
1  4.0  4  5.0  6
2  7.0  8  5.0  9

note that you can drop all the missing values completely

In [194]:
mis.dropna() #drops all the rows that have a missing column. Not ideal for data size

     0  1    2  3
0  1.0  2  3.0  4

In [195]:
mis[0].mean()

4.0

In [196]:
#fill na with the mean (do it colun)
mis[0].fillna(mis[0].mean(), inplace=True)

In [197]:
mis

     0  1    2  3
0  1.0  2  3.0  4
1  4.0  4  5.0  6
2  7.0  8  NaN  9

In [198]:
mis[0]

0    1.0
1    4.0
2    7.0
Name: 0, dtype: float64

# Group By

groups a column to agregate numerical columns

In [199]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [200]:
dt = pd.DataFrame(data)

In [201]:
dt

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [202]:
dt['Profit'] = dt["Sales"]/4

In [203]:
dt

  Company   Person  Sales  Profit
0    GOOG      Sam    200   50.00
1    GOOG  Charlie    120   30.00
2    MSFT      Amy    340   85.00
3    MSFT  Vanessa    124   31.00
4      FB     Carl    243   60.75
5      FB    Sarah    350   87.50

In [204]:
dt

  Company   Person  Sales  Profit
0    GOOG      Sam    200   50.00
1    GOOG  Charlie    120   30.00
2    MSFT      Amy    340   85.00
3    MSFT  Vanessa    124   31.00
4      FB     Carl    243   60.75
5      FB    Sarah    350   87.50

In [205]:
dt.groupby('Company').mean()

         Sales  Profit
Company
FB       296.5  74.125
GOOG     160.0  40.000
MSFT     232.0  58.000

In [206]:
f = dt.groupby('Company')['Sales'].max()

In [207]:
# f[dt.groupby('Person')['Profit'].mean() > 60]

# Merging and Concatenating

In [208]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [209]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [210]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [211]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

* it is essential that you concatenate tables with the same column names

In [212]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# MERGE

In [213]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [214]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [215]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [216]:
pd.merge(left, right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [217]:
pd.merge(left, right, on='key', how='right')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [218]:
pd.merge(right, left, on='key')

  key   C   D   A   B
0  K0  C0  D0  A0  B0
1  K1  C1  D1  A1  B1
2  K2  C2  D2  A2  B2
3  K3  C3  D3  A3  B3

### Little throwback to groupby

In [219]:
dt

  Company   Person  Sales  Profit
0    GOOG      Sam    200   50.00
1    GOOG  Charlie    120   30.00
2    MSFT      Amy    340   85.00
3    MSFT  Vanessa    124   31.00
4      FB     Carl    243   60.75
5      FB    Sarah    350   87.50

In [220]:
dt['Sales'] > 150

0     True
1    False
2     True
3    False
4     True
5     True
Name: Sales, dtype: bool

In [221]:
dt[dt['Sales'] > 150]

  Company Person  Sales  Profit
0    GOOG    Sam    200   50.00
2    MSFT    Amy    340   85.00
4      FB   Carl    243   60.75
5      FB  Sarah    350   87.50

In [222]:
(dt['Sales'] > 150) & (dt['Profit'] > 50)

0    False
1    False
2     True
3    False
4     True
5     True
dtype: bool

In [223]:
dt[(dt['Sales'] > 150) & (dt['Profit'] > 50)]

  Company Person  Sales  Profit
2    MSFT    Amy    340   85.00
4      FB   Carl    243   60.75
5      FB  Sarah    350   87.50

In [224]:
dt.groupby('Person')['Profit'].sum().sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of Person
Amy        85.00
Carl       60.75
Charlie    30.00
Sam        50.00
Sarah      87.50
Vanessa    31.00
Name: Profit, dtype: float64>